IDEA Open Model
ReinfDiagramType Enumeration
Compatible with IDEA StatiCa 20.1
 Reinforcement stress-strain diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ReinfDiagramType
Public Enumeration ReinfDiagramType
Members
Member name | Value | Description
BilinerWithAnInclinedTopBranch | 0 |  Billinear with an inclined top branch
BilinerWithOutAnInclinedTopBranch | 1 |  Billinear without an inclined top branch
DefinedByUser | 2 |  Defined by user
See Also
Reference
IdeaRS.OpenModel.Material Namespace